
&НаКлиенте
Процедура Слагаемое1ПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура Слагаемое2ПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСумму()
	Сумма = Слагаемое1 + Слагаемое2;	
КонецПроцедуры

&НаКлиенте
Процедура Поприветствовать(Команда)
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Привет!");
КонецПроцедуры

&НаКлиенте
Процедура ВычитаемоеПриИзменении(Элемент)
	РассчиттьРазность();
КонецПроцедуры

&НаКлиенте
Процедура УменьшаемоеПриИзменении(Элемент)
	РассчиттьРазность();
КонецПроцедуры         

&НаКлиенте
Процедура РассчиттьРазность()
	Разность = Уменьшаемое - Вычитаемое;	
КонецПроцедуры
